package question;

/** Q3 现在有2个数组, 这两个数组都已经是经过排序后从小到大的数组(你不需要对这两个数组再次排序，默认已经是有序的了)。
 * 现在需要你将这两个有序的数组合并成一个有序的, 从小到大的数组
 * 方法传入参数: 2个已经排序(从小到大)的数组
 * 方法返回值: 1个从小到大的数组
 * 例子1: 传入参数array1为{1,5,7,8,9} array2为{0,2,3,6}。 返回值{0,1,2,3,5,6,7,8,9}
 * 例子2: 传入参数array1为{3,4,7,10} array2为{3,4,6}。 返回值{3,3,4,4,6,7,10}
 * 例子3: 传入参数array1为{3,4,7,10} array2为{}。 返回值{3,4,7,10}
 */

public class Q3 {
    public int [] mergeArray(int [] array1, int [] array2){
       //方法返回值: 1个从小到大的数组
        int [] min;
        //先遍历一下 然后呢 没了



        return null;
    }
}
